In [37]:
import pandas as pd
import numpy as np

In [38]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [39]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### The From_To column would be better as two separate columns! Split eachstring on the underscore delimiter _ to give a new temporary DataFrame withthe correct values. Assign the correct column names to this temporaryDataFrame.

In [40]:
for i in df.From_To:
    i = i.split('_')
    print(i)

['LoNDon', 'paris']
['MAdrid', 'miLAN']
['londON', 'StockhOlm']
['Budapest', 'PaRis']
['Brussels', 'londOn']

In [41]:
 l= [i.split('_') for i in df.From_To]

In [42]:
l

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [43]:
l1=[]
for x,y in l:
    l1.append(x)

In [44]:
l1

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [45]:
df['From'] = l1

In [46]:
df

            From_To  FlightNumber  RecentDelays              Airline      From
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)    LoNDon
1      MAdrid_miLAN           NaN            []    <Air France> (12)    MAdrid
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )    londON
3    Budapest_PaRis           NaN          [13]       12. Air France  Budapest
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"  Brussels

In [47]:
l2=[]
for x,y in l:
    l2.append(y)
df['To'] = l2

### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [48]:
df = df.drop('From_To',axis=1)

### Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter isuppercase (e.g. "londON" should become "London".)

In [49]:
for x in df.From:
    x.title()

In [50]:
df.From = [x.title() for x in df.From]

In [51]:
df.To = [c.title() for c in df.To]

In [52]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [53]:
df.FlightNumber[1] = df.FlightNumber[0]+10

C:\conda_temp/ipykernel_17860/2522428073.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.FlightNumber[1] = df.FlightNumber[0]+10

In [54]:
df.FlightNumber[3] = df.FlightNumber[2]+10

C:\conda_temp/ipykernel_17860/2664166849.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.FlightNumber[3] = df.FlightNumber[2]+10

In [55]:
df.FlightNumber = df.FlightNumber.astype(int)

In [56]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

C:\conda_temp/ipykernel_17860/1008412122.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['RecentDelays'][1] = np.NaN

In [28]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055           NaN    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [63]:
df_delays  = pd.DataFrame(df['RecentDelays'].values.tolist())
df_delays.cloumns = ['delays_{}'.format(n) for n in range(1,len(df_delays.columns)+1)]
df.delays_1 = df_delays[0]

C:\conda_temp/ipykernel_17860/1190522228.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df_delays.cloumns = ['delays_{}'.format(n) for n in range(1,len(df_delays.columns)+1)]
C:\conda_temp/ipykernel_17860/1190522228.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.delays_1 = df_delays[0]

In [71]:
df['delays_1'] = df_delays[0].values

In [76]:
df['delays_2'] = df_delays[1].values
df['delays_3'] - df_delays[2].values

KeyError: 'delays_3'

In [77]:
df

,FlightNumber,RecentDelays,Airline,From,To,delays_1,delays_2
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0

In [80]:
df['delays_3'] = df_delays[2].values

In [83]:
df = df.drop('RecentDelays',axis=1)
df

,FlightNumber,Airline,From,To,delays_1,delays_2,delays_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN